In [19]:
import numpy as np
import pandas as pd
import random as rm

In [4]:
dict1={'Name':['Ram','Sita','Lakman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3     NaN  33.0  Chennai

In [7]:
dict1={'Name':['Ram','Sita','Lakman',None],
      'Age':[30,31,None,33],
      'City':[None,'Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

     Name   Age     City
0     Ram  30.0     None
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3    None  33.0  Chennai

In [6]:
dict1={'Name':['Ram','Sita','Lakman','Null'],
      'Age':[30,31,'Null',33],
      'City':['Null','Hyd','Pune','Chennai']}
pd.DataFrame(dict1)

     Name   Age     City
0     Ram    30     Null
1    Sita    31      Hyd
2  Lakman  Null     Pune
3    Null    33  Chennai

In [9]:
# Recommended

dict1={'Name':['Ram','Sita','Lakman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3     NaN  33.0  Chennai

$Mathod- 1$

**Fill with a random number to all Null values**

In [10]:
df.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [15]:
df.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

In [14]:
df.isnull().count()

Name    4
Age     4
City    4
dtype: int64

In [16]:
df.isna()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

$fillna$

In [21]:
df.fillna(40,inplace=True)
df

     Name   Age     City
0     Ram  30.0       40
1    Sita  31.0      Hyd
2  Lakman  40.0     Pune
3      40  33.0  Chennai

In [26]:
df.dtypes.values

array([dtype('O'), dtype('float64'), dtype('O')], dtype=object)

$Method -2$:
    
**Fill the random value by using column wise**

In [27]:
dict1={'Name':['Ram','Sita','Lakman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3     NaN  33.0  Chennai

In [28]:
df['Name'].fillna("Raheem", inplace=True)
df['Age'].fillna(32, inplace=True)
df['City'].fillna("Blr",inplace=True)
df

     Name   Age     City
0     Ram  30.0      Blr
1    Sita  31.0      Hyd
2  Lakman  32.0     Pune
3  Raheem  33.0  Chennai

$Method - 3$:

****
- pad

- bfill

- backfill

- ffill

In [29]:
dict1={'Name':['Ram','Sita','Lakman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3     NaN  33.0  Chennai

In [33]:
print("========= Original=========")
print(df)

print("========= pad =========")
print(df.fillna(method='pad', axis=1))

print("========= ffill =========")
print(df.fillna(method='ffill', axis=1))

print("========= bfill =========")
print(df.fillna(method='bfill', axis=1))

print("========= backfill =========")
print(df.fillna(method='backfill', axis=1))


# bfill - take the next value
# backfill  - take the next value same like bfill
# ffill - take the privous value same like pad

========= Original=========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3     NaN  33.0  Chennai
========= pad =========
     Name     Age     City
0     Ram    30.0     30.0
1    Sita    31.0      Hyd
2  Lakman  Lakman     Pune
3     NaN    33.0  Chennai
========= bfill =========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman  Pune     Pune
3    33.0  33.0  Chennai
========= backfill =========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman  Pune     Pune
3    33.0  33.0  Chennai
========= ffill =========
     Name     Age     City
0     Ram    30.0     30.0
1    Sita    31.0      Hyd
2  Lakman  Lakman     Pune
3     NaN    33.0  Chennai

In [34]:
print("========= Original=========")
print(df)

print("========= pad =========")
print(df.fillna(method='pad'))

print("========= pad =========")
print(df.fillna(method='pad', axis=1))

========= Original=========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3     NaN  33.0  Chennai
========= pad =========
     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman  31.0     Pune
3  Lakman  33.0  Chennai
========= pad =========
     Name     Age     City
0     Ram    30.0     30.0
1    Sita    31.0      Hyd
2  Lakman  Lakman     Pune
3     NaN    33.0  Chennai

$Method - 4$:
    
- Mean

- Median

- Mode

In [39]:
dict1={'Name':['Ram','Sita','Lakman',np.nan],
      'Age':[30,31,np.nan,33],
      'City':[np.nan,'Hyd','Pune','Chennai']}
df=pd.DataFrame(dict1)
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3     NaN  33.0  Chennai

In [40]:
mean_age=round(df['Age'].mean(),2)
df['Age'].fillna(mean_age)

0    30.00
1    31.00
2    31.33
3    33.00
Name: Age, dtype: float64

In [41]:
med_age=round(df['Age'].median(),2)
df['Age'].fillna(med_age)

0    30.0
1    31.0
2    31.0
3    33.0
Name: Age, dtype: float64

In [44]:
mod_age=df['Name'].mode()
df['Name'].fillna(mod_age)

0       Ram
1      Sita
2    Lakman
3       NaN
Name: Name, dtype: object

In [43]:
df

     Name   Age     City
0     Ram  30.0      NaN
1    Sita  31.0      Hyd
2  Lakman   NaN     Pune
3     NaN  33.0  Chennai

- Mode is used for categorical data

- mean and median is used for numerical data